app/Controllers/Main.php

    public function loginPengajar()
    {
        $username       = $this->request->getVar('username');
        $password       = $this->request->getVar('password');
        // Kelemahan jika username sama maka akan terjadi bentrok
        $cekUsername    = $this->pengajarModel->where(array('username' => $username))->get()->getRowArray();
---
SELECT *
FROM `pengajar`
WHERE `username` = 'admin'

    public function profile($id_santri)
    {
        $santri         = $this->santriModel->find($id_santri);
        $empat_surat    = $this->hafalanModel->where(array('id_santri' => $id_santri))->where(array('jenis' => '4 Surat'))->get()->getResultArray();
        $juz_30         = $this->hafalanModel->where(array('id_santri' => $id_santri))->where(array('jenis' => 'Juz 30'))->get()->getResultArray();
---
SELECT *
FROM `santri`
WHERE `santri`.`id_santri` = '38'
SELECT *
FROM `hafalan`
WHERE `id_santri` = '38'
AND `jenis` = '4 Surat'

    public function updateProfile($id_santri)
    {
        $foto       = $this->request->getFile('ubah-formFile');
        if ($foto->getError() == 4) {
            $namaFoto = $this->request->getVar('ubah-formFoto');
        } else {
            $replace = $this->request->getVar('ubah-formFoto');
            if ($replace !== '') {
                unlink('./img/' . $replace);
            }
            $namaFoto   = $foto->getRandomName();
            $foto->move('img', $namaFoto);
        }

        $this->santriModel->save([
            'id_santri'         => $id_santri,
            'nama'              => $this->request->getVar('ubah-nama-lengkap'),
            'alamat'            => $this->request->getVar('ubah-alamat'),
            'wali'              => $this->request->getVar('ubah-nama-wali'),
            'tanggal_lahir'     => $this->request->getVar('ubah-ttl'),
            'kelas'             => $this->request->getVar('ubah-kelas'),
            'foto'              => $namaFoto
        ]);
---
UPDATE `santri` SET `nama` = 'asd', `alamat` = 'asd', `wali` = 'asd', `tanggal_lahir` = '2023-10-03', `kelas` = 'asd', `foto` = '1698050996_befb15c95d94d6332a1e.jpg'
WHERE `santri`.`id_santri` IN ('39')

    public function dashboard(): string
    {
        $pengajar   = count($this->pengajarModel->get()->getResultArray());
        $santri     = count($this->santriModel->get()->getResultArray());
---
SELECT *
FROM `pengajar`
SELECT *
FROM `santri`

    public function dataSantri(): string
    {
        $santri = $this->santriModel->findAll();
        $i = 0;
        foreach ($santri as $s) :
            $pengajar   = $this->pengajarModel->where(array('id_pengajar' => $s['input_oleh']))->get()->getRowArray();
---
SELECT *
FROM `santri`
SELECT *
FROM `pengajar`
WHERE `id_pengajar` = '34'

    public function masterDashboard(): string
    {
        $pengajar = $this->pengajarModel->findAll();
---
SELECT *
FROM `pengajar`

    public function updatePengajar($id_pengajar)
    {
        $passwordBaru = $this->request->getVar('password-admin');
        if ($passwordBaru == '') {
            $setPassword = $this->request->getVar('password-admin-default');
        } else {
            $setPassword = password_hash($passwordBaru, PASSWORD_DEFAULT);
        }

        $this->pengajarModel->save([
            'id_pengajar'   => $id_pengajar,
            'nama'          => $this->request->getVar('nama-admin'),
            'username'      => $this->request->getVar('username-admin'),
            'password'      => $setPassword,
            'gelar'         => $this->request->getVar('gelar-admin')
        ]);
---
UPDATE `pengajar` SET `nama` = 'Makima', `username` = 'makima', `password` = '$2y$10$pvELB4tBSMSaOYq/cC1MDuKI4H6yiyAOCeciQuJ2FsydSvDO90DCC', `gelar` = 'Ustadzah'
WHERE `pengajar`.`id_pengajar` IN ('34')